var City =
[
    {
        "id": "1",
        "text": "北京市",
        "state": "closed",
        "children": [
            {
                "id": "1",
                "text": "北京市辖区",
                "code": "1101"
            },
            {
                "id": "1",
                "text": "北京市辖县",
                "code": "1102"
            }
        ]
    },
    {
        "id": "2",
        "text": "天津市",
        "state": "closed",
        "children": [
            {
                "id": "2",
                "text": "天津市辖区",
                "code": "1201"
            },
            {
                "id": "2",
                "text": "天津市辖县",
                "code": "1202"
            }
        ]
    },
    {
        "id": "3",
        "text": "河北省",
        "state": "closed",
        "children": [
            {
                "id": "3",
                "text": "石家庄市",
                "code": "1301"
            },
            {
                "id": "4",
                "text": "唐山市",
                "code": "1302"
            },
            {
                "id": "5",
                "text": "秦皇岛市",
                "code": "1303"
            },
            {
                "id": "6",
                "text": "邯郸市",
                "code": "1304"
            },
            {
                "id": "7",
                "text": "邢台市",
                "code": "1305"
            },
            {
                "id": "8",
                "text": "保定市",
                "code": "1306"
            },
            {
                "id": "9",
                "text": "张家口市",
                "code": "1307"
            },
            {
                "id": "10",
                "text": "承德市",
                "code": "1308"
            },
            {
                "id": "11",
                "text": "沧州市",
                "code": "1309"
            },
            {
                "id": "12",
                "text": "廊坊市",
                "code": "1310"
            },
            {
                "id": "13",
                "text": "衡水市",
                "code": "1311"
            }
        ]
    },
    {
        "id": "4",
        "text": "山西省",
        "state": "closed",
        "children": [
            {
                "id": "14",
                "text": "太原市",
                "code": "1401"
            },
            {
                "id": "15",
                "text": "大同市",
                "code": "1402"
            },
            {
                "id": "16",
                "text": "阳泉市",
                "code": "1403"
            },
            {
                "id": "17",
                "text": "长治市",
                "code": "1404"
            },
            {
                "id": "18",
                "text": "晋城市",
                "code": "1405"
            },
            {
                "id": "19",
                "text": "朔州市",
                "code": "1406"
            },
            {
                "id": "20",
                "text": "晋中市",
                "code": "1407"
            },
            {
                "id": "21",
                "text": "运城市",
                "code": "1408"
            },
            {
                "id": "22",
                "text": "忻州市",
                "code": "1409"
            },
            {
                "id": "23",
                "text": "临汾市",
                "code": "1410"
            },
            {
                "id": "24",
                "text": "吕梁市",
                "code": "1411"
            }
        ]
    },
    {
        "id": "5",
        "text": "内蒙古自治区",
        "state": "closed",
        "children": [
            {
                "id": "25",
                "text": "呼和浩特市",
                "code": "1501"
            },
            {
                "id": "26",
                "text": "包头市",
                "code": "1502"
            },
            {
                "id": "27",
                "text": "乌海市",
                "code": "1503"
            },
            {
                "id": "28",
                "text": "赤峰市",
                "code": "1504"
            },
            {
                "id": "29",
                "text": "通辽市",
                "code": "1505"
            },
            {
                "id": "30",
                "text": "鄂尔多斯市",
                "code": "1506"
            },
            {
                "id": "31",
                "text": "呼伦贝尔市",
                "code": "1507"
            },
            {
                "id": "32",
                "text": "巴彦淖尔市",
                "code": "1508"
            },
            {
                "id": "33",
                "text": "乌兰察布市",
                "code": "1509"
            },
            {
                "id": "34",
                "text": "兴安盟",
                "code": "1522"
            },
            {
                "id": "35",
                "text": "锡林郭勒盟",
                "code": "1525"
            },
            {
                "id": "36",
                "text": "阿拉善盟",
                "code": "1529"
            }
        ]
    },
    {
        "id": "6",
        "text": "辽宁省",
        "state": "closed",
        "children": [
            {
                "id": "37",
                "text": "沈阳市",
                "code": "2101"
            },
            {
                "id": "38",
                "text": "大连市",
                "code": "2102"
            },
            {
                "id": "39",
                "text": "鞍山市",
                "code": "2103"
            },
            {
                "id": "40",
                "text": "抚顺市",
                "code": "2104"
            },
            {
                "id": "41",
                "text": "本溪市",
                "code": "2105"
            },
            {
                "id": "42",
                "text": "丹东市",
                "code": "2106"
            },
            {
                "id": "43",
                "text": "锦州市",
                "code": "2107"
            },
            {
                "id": "44",
                "text": "营口市",
                "code": "1208"
            },
            {
                "id": "45",
                "text": "阜新市",
                "code": "1209"
            },
            {
                "id": "46",
                "text": "辽阳市",
                "code": "2110"
            },
            {
                "id": "47",
                "text": "盘锦市",
                "code": "2111"
            },
            {
                "id": "48",
                "text": "铁岭市",
                "code": "2112"
            },
            {
                "id": "49",
                "text": "朝阳市",
                "code": "2113"
            },
            {
                "id": "50",
                "text": "葫芦岛市",
                "code": "2114"
            }
        ]
    },
    {
        "id": "7",
        "text": "吉林省",
        "state": "closed",
        "children": [
            {
                "id": "51",
                "text": "长春市",
                "code": "2201"
            },
            {
                "id": "52",
                "text": "吉林市",
                "code": "2202"
            },
            {
                "id": "53",
                "text": "四平市",
                "code": "2203"
            },
            {
                "id": "54",
                "text": "辽源市",
                "code": "2204"
            },
            {
                "id": "55",
                "text": "通化市",
                "code": "2205"
            },
            {
                "id": "56",
                "text": "白山市",
                "code": "2206"
            },
            {
                "id": "57",
                "text": "松原市",
                "code": "2207"
            },
            {
                "id": "58",
                "text": "白城市",
                "code": "2208"
            },
            {
                "id": "59",
                "text": "延边朝鲜族自治州",
                "code": "2224"
            }
        ]
    },
    {
        "id": "8",
        "text": "黑龙江省",
        "state": "closed",
        "children": [
            {
                "id": "60",
                "text": "哈尔滨市",
                "code": "2301"
            },
            {
                "id": "61",
                "text": "齐齐哈尔市",
                "code": "2302"
            },
            {
                "id": "62",
                "text": "鸡西市",
                "code": "2303"
            },
            {
                "id": "63",
                "text": "鹤岗市",
                "code": "2304"
            },
            {
                "id": "64",
                "text": "双鸭山市",
                "code": "2305"
            },
            {
                "id": "65",
                "text": "大庆市",
                "code": "2306"
            },
            {
                "id": "66",
                "text": "伊春市",
                "code": "2307"
            },
            {
                "id": "67",
                "text": "佳木斯市",
                "code": "2308"
            },
            {
                "id": "68",
                "text": "七台河市",
                "code": "2309"
            },
            {
                "id": "69",
                "text": "牡丹江市",
                "code": "2310"
            },
            {
                "id": "70",
                "text": "黑河市",
                "code": "2311"
            },
            {
                "id": "71",
                "text": "绥化市",
                "code": "2312"
            },
            {
                "id": "72",
                "text": "大兴安岭地区",
                "code": "2327"
            }
        ]
    },
    {
        "id": "9",
        "text": "上海市",
        "state": "closed",
        "children": [
            {
                "id": "73",
                "text": "上海市辖区",
                "code": "3101"
            },
            {
                "id": "73",
                "text": "上海市辖县",
                "code": "3102"
            }
        ]
    },
    {
        "id": "10",
        "text": "江苏省",
        "state": "closed",
        "children": [
            {
                "id": "74",
                "text": "南京市",
                "code": "3201"
            },
            {
                "id": "75",
                "text": "无锡市",
                "code": "3202"
            },
            {
                "id": "76",
                "text": "徐州市",
                "code": "3203"
            },
            {
                "id": "77",
                "text": "常州市",
                "code": "3204"
            },
            {
                "id": "78",
                "text": "苏州市",
                "code": "3205"
            },
            {
                "id": "79",
                "text": "南通市",
                "code": "3206"
            },
            {
                "id": "80",
                "text": "连云港市",
                "code": "3207"
            },
            {
                "id": "81",
                "text": "淮安市",
                "code": "3208"
            },
            {
                "id": "82",
                "text": "盐城市",
                "code": "3209"
            },
            {
                "id": "83",
                "text": "扬州市",
                "code": "3210"
            },
            {
                "id": "84",
                "text": "镇江市",
                "code": "3211"
            },
            {
                "id": "85",
                "text": "泰州市",
                "code": "3212"
            },
            {
                "id": "86",
                "text": "宿迁市",
                "code": "3213"
            }
        ]
    },
    {
        "id": "11",
        "text": "浙江省",
        "state": "closed",
        "children": [
            {
                "id": "87",
                "text": "杭州市",
                "code": "3301"
            },
            {
                "id": "88",
                "text": "宁波市",
                "code": "3302"
            },
            {
                "id": "89",
                "text": "温州市",
                "code": "3303"
            },
            {
                "id": "90",
                "text": "嘉兴市",
                "code": "3304"
            },
            {
                "id": "91",
                "text": "湖州市",
                "code": "3305"
            },
            {
                "id": "92",
                "text": "绍兴市",
                "code": "3306"
            },
            {
                "id": "93",
                "text": "金华市",
                "code": "3307"
            },
            {
                "id": "94",
                "text": "衢州市",
                "code": "3308"
            },
            {
                "id": "95",
                "text": "舟山市",
                "code": "3309"
            },
            {
                "id": "96",
                "text": "台州市",
                "code": "3310"
            },
            {
                "id": "97",
                "text": "丽水市",
                "code": "3311"
            }
        ]
    },
    {
        "id": "12",
        "text": "安徽省",
        "state": "closed",
        "children": [
            {
                "id": "98",
                "text": "合肥市",
                "code": "3401"
            },
            {
                "id": "99",
                "text": "芜湖市",
                "code": "3402"
            },
            {
                "id": "100",
                "text": "蚌埠市",
                "code": "3403"
            },
            {
                "id": "101",
                "text": "淮南市",
                "code": "3404"
            },
            {
                "id": "102",
                "text": "马鞍山市",
                "code": "3405"
            },
            {
                "id": "103",
                "text": "淮北市",
                "code": "3406"
            },
            {
                "id": "104",
                "text": "铜陵市",
                "code": "3407"
            },
            {
                "id": "105",
                "text": "安庆市",
                "code": "3408"
            },
            {
                "id": "106",
                "text": "黄山市",
                "code": "3410"
            },
            {
                "id": "107",
                "text": "滁州市",
                "code": "3411"
            },
            {
                "id": "108",
                "text": "阜阳市",
                "code": "3412"
            },
            {
                "id": "109",
                "text": "宿州市",
                "code": "3413"
            },
            {
                "id": "110",
                "text": "巢湖市",
                "code": "3414"
            },
            {
                "id": "111",
                "text": "六安市",
                "code": "3415"
            },
            {
                "id": "112",
                "text": "亳州市",
                "code": "3416"
            },
            {
                "id": "113",
                "text": "池州市",
                "code": "3417"
            },
            {
                "id": "114",
                "text": "宣城市",
                "code": "3418"
            }
        ]
    },
    {
        "id": "13",
        "text": "福建省",
        "state": "closed",
        "children": [
            {
                "id": "115",
                "text": "福州市",
                "code": "3501"
            },
            {
                "id": "116",
                "text": "厦门市",
                "code": "3502"
            },
            {
                "id": "117",
                "text": "莆田市",
                "code": "3503"
            },
            {
                "id": "118",
                "text": "三明市",
                "code": "3504"
            },
            {
                "id": "119",
                "text": "泉州市",
                "code": "3505"
            },
            {
                "id": "120",
                "text": "漳州市",
                "code": "3506"
            },
            {
                "id": "121",
                "text": "南平市",
                "code": "3507"
            },
            {
                "id": "122",
                "text": "龙岩市",
                "code": "3508"
            },
            {
                "id": "123",
                "text": "宁德市",
                "code": "3509"
            }
        ]
    },
    {
        "id": "14",
        "text": "江西省",
        "state": "closed",
        "children": [
            {
                "id": "124",
                "text": "南昌市",
                "code": "3601"
            },
            {
                "id": "125",
                "text": "景德镇市",
                "code": "3602"
            },
            {
                "id": "126",
                "text": "萍乡市",
                "code": "3603"
            },
            {
                "id": "127",
                "text": "九江市",
                "code": "3604"
            },
            {
                "id": "128",
                "text": "新余市",
                "code": "3605"
            },
            {
                "id": "129",
                "text": "鹰潭市",
                "code": "3606"
            },
            {
                "id": "130",
                "text": "赣州市",
                "code": "3607"
            },
            {
                "id": "131",
                "text": "吉安市",
                "code": "3608"
            },
            {
                "id": "132",
                "text": "宜春市",
                "code": "3609"
            },
            {
                "id": "133",
                "text": "抚州市",
                "code": "3610"
            },
            {
                "id": "134",
                "text": "上饶市",
                "code": "3611"
            }
        ]
    },
    {
        "id": "15",
        "text": "山东省",
        "state": "closed",
        "children": [
            {
                "id": "135",
                "text": "济南市",
                "code": "3701"
            },
            {
                "id": "136",
                "text": "青岛市",
                "code": "3702"
            },
            {
                "id": "137",
                "text": "淄博市",
                "code": "3703"
            },
            {
                "id": "138",
                "text": "枣庄市",
                "code": "3704"
            },
            {
                "id": "139",
                "text": "东营市",
                "code": "3705"
            },
            {
                "id": "140",
                "text": "烟台市",
                "code": "3706"
            },
            {
                "id": "141",
                "text": "潍坊市",
                "code": "3707"
            },
            {
                "id": "142",
                "text": "济宁市",
                "code": "3708"
            },
            {
                "id": "143",
                "text": "泰安市",
                "code": "3709"
            },
            {
                "id": "144",
                "text": "威海市",
                "code": "3710"
            },
            {
                "id": "145",
                "text": "日照市",
                "code": "3711"
            },
            {
                "id": "146",
                "text": "莱芜市",
                "code": "3712"
            },
            {
                "id": "147",
                "text": "临沂市",
                "code": "3713"
            },
            {
                "id": "148",
                "text": "德州市",
                "code": "3714"
            },
            {
                "id": "149",
                "text": "聊城市",
                "code": "3715"
            },
            {
                "id": "150",
                "text": "滨州市",
                "code": "3716"
            },
            {
                "id": "151",
                "text": "荷泽市",
                "code": "3717"
            }
        ]
    },
    {
        "id": "16",
        "text": "河南省",
        "state": "closed",
        "children": [
            {
                "id": "152",
                "text": "郑州市",
                "code": "4101"
            },
            {
                "id": "153",
                "text": "开封市",
                "code": "4102"
            },
            {
                "id": "154",
                "text": "洛阳市",
                "code": "4103"
            },
            {
                "id": "155",
                "text": "平顶山市",
                "code": "4104"
            },
            {
                "id": "156",
                "text": "安阳市",
                "code": "4105"
            },
            {
                "id": "157",
                "text": "鹤壁市",
                "code": "4106"
            },
            {
                "id": "158",
                "text": "新乡市",
                "code": "4107"
            },
            {
                "id": "159",
                "text": "焦作市",
                "code": "4108"
            },
            {
                "id": "160",
                "text": "濮阳市",
                "code": "4109"
            },
            {
                "id": "161",
                "text": "许昌市",
                "code": "4110"
            },
            {
                "id": "162",
                "text": "漯河市",
                "code": "4111"
            },
            {
                "id": "163",
                "text": "三门峡市",
                "code": "4112"
            },
            {
                "id": "164",
                "text": "南阳市",
                "code": "4113"
            },
            {
                "id": "165",
                "text": "商丘市",
                "code": "4114"
            },
            {
                "id": "166",
                "text": "信阳市",
                "code": "4115"
            },
            {
                "id": "167",
                "text": "周口市",
                "code": "4116"
            },
            {
                "id": "168",
                "text": "驻马店市",
                "code": "4117"
            }
        ]
    },
    {
        "id": "17",
        "text": "湖北省",
        "state": "closed",
        "children": [
            {
                "id": "169",
                "text": "武汉市",
                "code": "4201"
            },
            {
                "id": "170",
                "text": "黄石市",
                "code": "4202"
            },
            {
                "id": "171",
                "text": "十堰市",
                "code": "4203"
            },
            {
                "id": "172",
                "text": "宜昌市",
                "code": "4205"
            },
            {
                "id": "173",
                "text": "襄樊市",
                "code": "4206"
            },
            {
                "id": "174",
                "text": "鄂州市",
                "code": "4207"
            },
            {
                "id": "175",
                "text": "荆门市",
                "code": "4208"
            },
            {
                "id": "176",
                "text": "孝感市",
                "code": "4209"
            },
            {
                "id": "177",
                "text": "荆州市",
                "code": "4210"
            },
            {
                "id": "178",
                "text": "黄冈市",
                "code": "4211"
            },
            {
                "id": "179",
                "text": "咸宁市",
                "code": "4212"
            },
            {
                "id": "180",
                "text": "随州市",
                "code": "4213"
            },
            {
                "id": "181",
                "text": "恩施土家族苗族自治州",
                "code": "4228"
            },
            {
                "id": "182",
                "text": "其它",
                "code": "4290"
            }
        ]
    },
    {
        "id": "18",
        "text": "湖南省",
        "state": "closed",
        "children": [
            {
                "id": "183",
                "text": "长沙市",
                "code": "4301"
            },
            {
                "id": "184",
                "text": "株洲市",
                "code": "4302"
            },
            {
                "id": "185",
                "text": "湘潭市",
                "code": "4303"
            },
            {
                "id": "186",
                "text": "衡阳市",
                "code": "4304"
            },
            {
                "id": "187",
                "text": "邵阳市",
                "code": "4305"
            },
            {
                "id": "188",
                "text": "岳阳市",
                "code": "4306"
            },
            {
                "id": "189",
                "text": "常德市",
                "code": "4307"
            },
            {
                "id": "190",
                "text": "张家界市",
                "code": "4308"
            },
            {
                "id": "191",
                "text": "益阳市",
                "code": "4309"
            },
            {
                "id": "192",
                "text": "郴州市",
                "code": "4310"
            },
            {
                "id": "193",
                "text": "永州市",
                "code": "4311"
            },
            {
                "id": "194",
                "text": "怀化市",
                "code": "4312"
            },
            {
                "id": "195",
                "text": "娄底市",
                "code": "4313"
            },
            {
                "id": "196",
                "text": "湘西土家族苗族自治州",
                "code": "4331"
            }
        ]
    },
    {
        "id": "19",
        "text": "广东省",
        "state": "closed",
        "children": [
            {
                "id": "197",
                "text": "广州市",
                "code": "4401"
            },
            {
                "id": "198",
                "text": "韶关市",
                "code": "4402"
            },
            {
                "id": "199",
                "text": "深圳市",
                "code": "4403"
            },
            {
                "id": "200",
                "text": "珠海市",
                "code": "4404"
            },
            {
                "id": "201",
                "text": "汕头市",
                "code": "4405"
            },
            {
                "id": "202",
                "text": "佛山市",
                "code": "4406"
            },
            {
                "id": "203",
                "text": "江门市",
                "code": "4407"
            },
            {
                "id": "204",
                "text": "湛江市",
                "code": "4408"
            },
            {
                "id": "205",
                "text": "茂名市",
                "code": "4409"
            },
            {
                "id": "206",
                "text": "肇庆市",
                "code": "4412"
            },
            {
                "id": "207",
                "text": "惠州市",
                "code": "4413"
            },
            {
                "id": "208",
                "text": "梅州市",
                "code": "4414"
            },
            {
                "id": "209",
                "text": "汕尾市",
                "code": "4415"
            },
            {
                "id": "210",
                "text": "河源市",
                "code": "4416"
            },
            {
                "id": "211",
                "text": "阳江市",
                "code": "4417"
            },
            {
                "id": "212",
                "text": "清远市",
                "code": "4418"
            },
            {
                "id": "213",
                "text": "东莞市",
                "code": "4419"
            },
            {
                "id": "214",
                "text": "中山市",
                "code": "4420"
            },
            {
                "id": "215",
                "text": "潮州市",
                "code": "4451"
            },
            {
                "id": "216",
                "text": "揭阳市",
                "code": "4452"
            },
            {
                "id": "217",
                "text": "云浮市",
                "code": "4453"
            }
        ]
    },
    {
        "id": "20",
        "text": "广西壮族自治区",
        "state": "closed",
        "children": [
            {
                "id": "218",
                "text": "南宁市",
                "code": "4501"
            },
            {
                "id": "219",
                "text": "柳州市",
                "code": "4502"
            },
            {
                "id": "220",
                "text": "桂林市",
                "code": "4503"
            },
            {
                "id": "221",
                "text": "梧州市",
                "code": "4504"
            },
            {
                "id": "222",
                "text": "北海市",
                "code": "4505"
            },
            {
                "id": "223",
                "text": "防城港市",
                "code": "4506"
            },
            {
                "id": "224",
                "text": "钦州市",
                "code": "4507"
            },
            {
                "id": "225",
                "text": "贵港市",
                "code": "4508"
            },
            {
                "id": "226",
                "text": "玉林市",
                "code": "4509"
            },
            {
                "id": "227",
                "text": "百色市",
                "code": "4510"
            },
            {
                "id": "228",
                "text": "贺州市",
                "code": "4511"
            },
            {
                "id": "229",
                "text": "河池市",
                "code": "4512"
            },
            {
                "id": "230",
                "text": "来宾市",
                "code": "4513"
            },
            {
                "id": "231",
                "text": "崇左市",
                "code": "4514"
            }
        ]
    },
    {
        "id": "21",
        "text": "海南省",
        "state": "closed",
        "children": [
            {
                "id": "232",
                "text": "海口市",
                "code": "4601"
            },
            {
                "id": "233",
                "text": "三亚市",
                "code": "4602"
            },
            {
                "id": "233",
                "text": "其它",
                "code": "4690"
            }
        ]
    },
    {
        "id": "22",
        "text": "重庆市",
        "state": "closed",
        "children": [
            {
                "id": "234",
                "text": "重庆市辖区",
                "code": "5001"
            },
            {
                "id": "234",
                "text": "重庆市辖县",
                "code": "5002"
            },
            {
                "id": "234",
                "text": "重庆市辖市",
                "code": "5003"
            }
        ]
    },
    {
        "id": "23",
        "text": "四川省",
        "state": "closed",
        "children": [
            {
                "id": "235",
                "text": "成都市",
                "code": "5101"
            },
            {
                "id": "236",
                "text": "自贡市",
                "code": "5103"
            },
            {
                "id": "237",
                "text": "攀枝花市",
                "code": "5104"
            },
            {
                "id": "238",
                "text": "泸州市",
                "code": "5105"
            },
            {
                "id": "239",
                "text": "德阳市",
                "code": "5106"
            },
            {
                "id": "240",
                "text": "绵阳市",
                "code": "5107"
            },
            {
                "id": "241",
                "text": "广元市",
                "code": "51078"
            },
            {
                "id": "242",
                "text": "遂宁市",
                "code": "5109"
            },
            {
                "id": "243",
                "text": "内江市",
                "code": "5110"
            },
            {
                "id": "244",
                "text": "乐山市",
                "code": "5111"
            },
            {
                "id": "245",
                "text": "南充市",
                "code": "5113"
            },
            {
                "id": "246",
                "text": "眉山市",
                "code": "5114"
            },
            {
                "id": "247",
                "text": "宜宾市",
                "code": "5115"
            },
            {
                "id": "248",
                "text": "广安市",
                "code": "5116"
            },
            {
                "id": "249",
                "text": "达州市",
                "code": "5117"
            },
            {
                "id": "250",
                "text": "雅安市",
                "code": "5118"
            },
            {
                "id": "251",
                "text": "巴中市",
                "code": "5119"
            },
            {
                "id": "252",
                "text": "资阳市",
                "code": "5120"
            },
            {
                "id": "253",
                "text": "阿坝藏族羌族自治州",
                "code": "5132"
            },
            {
                "id": "254",
                "text": "甘孜藏族自治州",
                "code": "5133"
            },
            {
                "id": "255",
                "text": "凉山彝族自治州",
                "code": "5134"
            }
        ]
    },
    {
        "id": "24",
        "text": "贵州省",
        "state": "closed",
        "children": [
            {
                "id": "256",
                "text": "贵阳市",
                "code": "5201"
            },
            {
                "id": "257",
                "text": "六盘水市",
                "code": "5202"
            },
            {
                "id": "258",
                "text": "遵义市",
                "code": "5203"
            },
            {
                "id": "259",
                "text": "安顺市",
                "code": "5204"
            },
            {
                "id": "260",
                "text": "铜仁地区",
                "code": "5222"
            },
            {
                "id": "261",
                "text": "黔西南布依族苗族自治州",
                "code": "5223"
            },
            {
                "id": "262",
                "text": "毕节地区",
                "code": "5224"
            },
            {
                "id": "263",
                "text": "黔东南苗族侗族自治州",
                "code": "5226"
            },
            {
                "id": "264",
                "text": "黔南布依族苗族自治州",
                "code": "5227"
            }
        ]
    },
    {
        "id": "25",
        "text": "云南省",
        "state": "closed",
        "children": [
            {
                "id": "265",
                "text": "昆明市",
                "code": "5301"
            },
            {
                "id": "266",
                "text": "曲靖市",
                "code": "5303"
            },
            {
                "id": "267",
                "text": "玉溪市",
                "code": "5304"
            },
            {
                "id": "268",
                "text": "保山市",
                "code": "5305"
            },
            {
                "id": "269",
                "text": "昭通市",
                "code": "5306"
            },
            {
                "id": "270",
                "text": "丽江市",
                "code": "5307"
            },
            {
                "id": "271",
                "text": "思茅市",
                "code": "5308"
            },
            {
                "id": "272",
                "text": "临沧市",
                "code": "5309"
            },
            {
                "id": "273",
                "text": "楚雄彝族自治州",
                "code": "5323"
            },
            {
                "id": "274",
                "text": "红河哈尼族彝族自治州",
                "code": "5325"
            },
            {
                "id": "275",
                "text": "文山壮族苗族自治州",
                "code": "5326"
            },
            {
                "id": "276",
                "text": "西双版纳傣族自治州",
                "code": "5328"
            },
            {
                "id": "277",
                "text": "大理白族自治州",
                "code": "5329"
            },
            {
                "id": "278",
                "text": "德宏傣族景颇族自治州",
                "code": "5331"
            },
            {
                "id": "279",
                "text": "怒江傈僳族自治州",
                "code": "5333"
            },
            {
                "id": "280",
                "text": "迪庆藏族自治州",
                "code": "5334"
            }
        ]
    },
    {
        "id": "26",
        "text": "西藏自治区",
        "state": "closed",
        "children": [
            {
                "id": "281",
                "text": "拉萨市",
                "code": "5401"
            },
            {
                "id": "282",
                "text": "昌都地区",
                "code": "5421"
            },
            {
                "id": "283",
                "text": "山南地区",
                "code": "5422"
            },
            {
                "id": "284",
                "text": "日喀则地区",
                "code": "5423"
            },
            {
                "id": "285",
                "text": "那曲地区",
                "code": "5424"
            },
            {
                "id": "286",
                "text": "阿里地区",
                "code": "5425"
            },
            {
                "id": "287",
                "text": "林芝地区",
                "code": "5426"
            }
        ]
    },
    {
        "id": "27",
        "text": "陕西省",
        "state": "closed",
        "children": [
            {
                "id": "288",
                "text": "西安市",
                "code": "6101"
            },
            {
                "id": "289",
                "text": "铜川市",
                "code": "6102"
            },
            {
                "id": "290",
                "text": "宝鸡市",
                "code": "6103"
            },
            {
                "id": "291",
                "text": "咸阳市",
                "code": "6104"
            },
            {
                "id": "292",
                "text": "渭南市",
                "code": "6105"
            },
            {
                "id": "293",
                "text": "延安市",
                "code": "6106"
            },
            {
                "id": "294",
                "text": "汉中市",
                "code": "6107"
            },
            {
                "id": "295",
                "text": "榆林市",
                "code": "6108"
            },
            {
                "id": "296",
                "text": "安康市",
                "code": "6109"
            },
            {
                "id": "297",
                "text": "商洛市",
                "code": "6110"
            }
        ]
    },
    {
        "id": "28",
        "text": "甘肃省",
        "state": "closed",
        "children": [
            {
                "id": "298",
                "text": "兰州市",
                "code": "6201"
            },
            {
                "id": "299",
                "text": "嘉峪关市",
                "code": "6202"
            },
            {
                "id": "300",
                "text": "金昌市",
                "code": "6203"
            },
            {
                "id": "301",
                "text": "白银市",
                "code": "6204"
            },
            {
                "id": "302",
                "text": "天水市",
                "code": "6205"
            },
            {
                "id": "303",
                "text": "武威市",
                "code": "6206"
            },
            {
                "id": "304",
                "text": "张掖市",
                "code": "6207"
            },
            {
                "id": "305",
                "text": "平凉市",
                "code": "6208"
            },
            {
                "id": "306",
                "text": "酒泉市",
                "code": "6209"
            },
            {
                "id": "307",
                "text": "庆阳市",
                "code": "6210"
            },
            {
                "id": "308",
                "text": "定西市",
                "code": "6211"
            },
            {
                "id": "309",
                "text": "陇南市",
                "code": "6212"
            },
            {
                "id": "310",
                "text": "临夏回族自治州",
                "code": "6229"
            },
            {
                "id": "311",
                "text": "甘南藏族自治州",
                "code": "6230"
            }
        ]
    },
    {
        "id": "29",
        "text": "青海省",
        "state": "closed",
        "children": [
            {
                "id": "312",
                "text": "西宁市",
                "code": "6301"
            },
            {
                "id": "313",
                "text": "海东地区",
                "code": "6321"
            },
            {
                "id": "314",
                "text": "海北藏族自治州",
                "code": "6322"
            },
            {
                "id": "315",
                "text": "黄南藏族自治州",
                "code": "6323"
            },
            {
                "id": "316",
                "text": "海南藏族自治州",
                "code": "6325"
            },
            {
                "id": "317",
                "text": "果洛藏族自治州",
                "code": "6326"
            },
            {
                "id": "318",
                "text": "玉树藏族自治州",
                "code": "6327"
            },
            {
                "id": "319",
                "text": "海西蒙古族藏族自治州",
                "code": "6328"
            }
        ]
    },
    {
        "id": "30",
        "text": "宁夏回族自治区",
        "state": "closed",
        "children": [
            {
                "id": "320",
                "text": "银川市",
                "code": "6401"
            },
            {
                "id": "321",
                "text": "石嘴山市",
                "code": "6402"
            },
            {
                "id": "322",
                "text": "吴忠市",
                "code": "6403"
            },
            {
                "id": "323",
                "text": "固原市",
                "code": "6404"
            },
            {
                "id": "324",
                "text": "中卫市",
                "code": "6405"
            }
        ]
    },
    {
        "id": "31",
        "text": "新疆维吾尔自治区",
        "state": "closed",
        "children": [
            {
                "id": "325",
                "text": "乌鲁木齐市",
                "code": "6501"
            },
            {
                "id": "326",
                "text": "克拉玛依市",
                "code": "6502"
            },
            {
                "id": "327",
                "text": "吐鲁番地区",
                "code": "6521"
            },
            {
                "id": "328",
                "text": "哈密地区",
                "code": "6522"
            },
            {
                "id": "329",
                "text": "昌吉回族自治州",
                "code": "6523"
            },
            {
                "id": "330",
                "text": "博尔塔拉蒙古自治州",
                "code": "6527"
            },
            {
                "id": "331",
                "text": "巴音郭楞蒙古自治州",
                "code": "6528"
            },
            {
                "id": "332",
                "text": "阿克苏地区",
                "code": "6529"
            },
            {
                "id": "333",
                "text": "克孜勒苏柯尔克孜自治州",
                "code": "6530"
            },
            {
                "id": "334",
                "text": "喀什地区",
                "code": "6531"
            },
            {
                "id": "335",
                "text": "和田地区",
                "code": "6532"
            },
            {
                "id": "336",
                "text": "伊犁哈萨克自治州",
                "code": "6540"
            },
            {
                "id": "337",
                "text": "塔城地区",
                "code": "6542"
            },
            {
                "id": "338",
                "text": "阿勒泰地区",
                "code": "6543"
            },
            {
                "id": "339",
                "text": "其它",
                "code": "6590"
            }
        ]
    }
]
